module.exports = {
  code: 
`1  // 今天心情好
2  // 我给你表演写代码
3  // 我要开始写啦
4  const { 😆, 🤗 } = 🌎;
5  😆.say('嫁给我吧!❤️');
6  🤗.response('好的，只要你请我吃🍉！');
7  Utils.marry(😆,🤗);
8  Utils.generateInvitation(😆,🤗);
9  // 好了我写完了
10 // 我要开始运行啦
1  // 今天心情好
2  // 我给你表演写代码
3  // 我要开始写啦
4  const { 😆, 🤗 } = 🌎;
5  😆.say('嫁给我吧!❤️');
6  🤗.response('好的，只要你请我吃🍉！');
7  Utils.marry(😆,🤗);
8  Utils.generateInvitation(😆,🤗);
9  // 好了我写完了
10 // 我要开始运行啦
1  // 今天心情好
2  // 我给你表演写代码
3  // 我要开始写啦
4  const { 😆, 🤗 } = 🌎;`,
  executions: [{
    name:'初始化',
    time: '',
    duration: 0,
    visible: false
  }, {
    name:'解压中',
    time: '',
    duration: 0,
    visible: false
  }, {
    name:'组装中',
    time: '',
    duration: 0,
    visible: false
  }, {
    name:'打包中',
    time: '',
    duration: 0,
    visible: false
  }, {
    name:'微笑🙂',
    time: '',
    duration: 0,
    visible: false
  }, {
    name:'大笑😄',
    time: '',
    duration: 0,
    visible: false
  }, {
    name:'编译中...',
    time: '',
    visible: false
  }],
  barrages: [
    '66666666',
    '愿你美梦成真',
    '你的邀请函真是美',
    '人美心更美',
    '你是最棒的',
    '哇哇哇',
    '还差女朋友吗',
    '今晚翻你牌',
    '看朕给你打下的江山',
    '你写代码老快了',
    '你的代码真是棒',
    '😗 😙 😚 😋 ',
    '只要代码写得好，单身永远跑不了'
  ],
}